[
  {
    "Name": "Super Mario Bros.",
    "Category": "Platformer",
    "ReleaseYear": 1985,
    "Publisher": "Nintendo",
    "ConsoleType": "NES",
    "CoverImage": "https://upload.wikimedia.org/wikipedia/en/0/03/Super_Mario_Bros._box.png",
    "Description": "A classic platform game in which players control Mario as he runs through the Mushroom Kingdom to save Princess Peach from the evil Bowser.",
    "RentalPricePerWeek": 2.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Gran Turismo 3: A-Spec",
    "Category": "Racing",
    "ReleaseYear": 2001,
    "Publisher": "Sony Computer Entertainment",
    "ConsoleType": "PlayStation 2",
    "CoverImage": "https://www.retroplaystationkopen.nl/assets/products/2005523.jpg",
    "Description": "A realistic racing simulator where players can race with a wide range of cars on various tracks around the world.",
    "RentalPricePerWeek": 6.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Pokémon LeafGreen",
    "Category": "RPG",
    "ReleaseYear": 2004,
    "Publisher": "Nintendo",
    "ConsoleType": "Game Boy Advance",
    "CoverImage": "https://upload.wikimedia.org/wikipedia/en/a/a7/Pokemon_LeafGreen_box.jpg",
    "Description": "A reissue of the original Pokémon Red and Blue games with improved graphics and additional features, where players explore the Kanto region and train Pokémon.",
    "RentalPricePerWeek": 3.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "The Legend of Zelda",
    "Category": "Action, Adventure",
    "ReleaseYear": 1986,
    "Publisher": "Nintendo",
    "ConsoleType": "NES",
    "CoverImage": "https://upload.wikimedia.org/wikipedia/en/4/41/Legend_of_zelda_cover_%28with_cartridge%29_gold.png",
    "Description": "A classic adventure game in which players control the legendary hero Link as he travels through the world of Hyrule to save Princess Zelda and defeat the evil Ganon.",
    "RentalPricePerWeek": 3.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Mega Man 2",
    "Category": "Action, Platformer",
    "ReleaseYear": 1987,
    "Publisher": "Capcom",
    "ConsoleType": "NES",
    "CoverImage": "https://upload.wikimedia.org/wikipedia/en/b/be/Megaman2_box.jpg",
    "Description": "A classic action-platform game in which players take on the role of Mega Man as they fight against the evil robots of Dr. Wily.",
    "RentalPricePerWeek": 4.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Pokémon Emerald",
    "Category": "RPG",
    "ReleaseYear": 2005,
    "Publisher": "Nintendo",
    "ConsoleType": "Game Boy Advance",
    "CoverImage": "https://m.media-amazon.com/images/I/7100mueH-uL._AC_UF1000,1000_QL80_.jpg",
    "Description": "An RPG where players explore the Hoenn region, catch Pokémon, and battle to become the Pokémon champion, while facing a new threat: Team Aqua and Team Magma.",
    "RentalPricePerWeek": 6.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Donkey Kong Country",
    "Category": "Platformer",
    "ReleaseYear": 1994,
    "Publisher": "Nintendo",
    "ConsoleType": "SNES",
    "CoverImage": "https://upload.wikimedia.org/wikipedia/en/1/1a/Donkey_Kong_Country_SNES_cover.png",
    "Description": "A side-scrolling platform game in which players control Donkey Kong and his friend Diddy Kong as they try to retrieve their stolen bananas from the evil King K. Rool.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Sonic the Hedgehog",
    "Category": "Platformer",
    "ReleaseYear": 1991,
    "Publisher": "Sega",
    "ConsoleType": "Sega Genesis",
    "CoverImage": "https://upload.wikimedia.org/wikipedia/en/b/ba/Sonic_the_Hedgehog_1_Genesis_box_art.jpg",
    "Description": "A platform game where players control the iconic blue hedgehog Sonic as he runs through colorful levels to stop Dr. Robotnik.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Robotron: 2084",
    "Category": "Multidirectional shooter",
    "ReleaseYear": 1982,
    "Publisher": "Atari",
    "ConsoleType": "Arcade",
    "CoverImage": "https://pixelatedarcade.objects-us-east-1.dream.io/coverart/162/1973/cover_8ae-robotron-2084-front-cover-artwork.jpg",
    "Description": "It is the year 2084, the world we all once knew is now overrun by robots. The majority of mankind was eliminated by the robots during a cybernetic revolt. As the player, you must rescue the surviving humans while defeating an endless wave of killer robots.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Spy Hunter",
    "Category": "Action",
    "ReleaseYear": 1983,
    "Publisher": "Webbrowser",
    "ConsoleType": "Arcade",
    "CoverImage": "https://pixelatedarcade.objects-us-east-1.dream.io/coverart/183/1332/cover_092-spy-hunter-media-cartridge-artwork.jpg",
    "Description": "You play as a spy in a car that is advanced and destroy enemies vehicles with weapons.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Donkey Kong",
    "Category": "Action",
    "ReleaseYear": 1981,
    "Publisher": "Nintendo",
    "ConsoleType": "Arcade",
    "CoverImage": "https://pixelatedarcade.objects-us-east-1.dream.io/coverart/61/1283/cover_68d-donkey-kong-front-cover-artwork.jpg",
    "Description": "Arcade video game and the first in the Donkey Kong series in which Jumpman (later retconned to be Mario) runs and jumps on platforms and climbs ladders to ascend a construction site and rescue Pauline from a giant gorilla, Donkey Kong.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "The Legend Of Zelda: A Link To The Past",
    "Category": "Action/Adventure",
    "ReleaseYear": 1992,
    "Publisher": "Nintendo",
    "ConsoleType": "Suoer NES",
    "CoverImage": "https://d28hgpri8am2if.cloudfront.net/book_images/onix/cvr9781421575414/legend-of-zelda-a-link-to-the-past-9781421575414_lg.jpg",
    "Description": "The Legend of Zelda: A Link to the Past is a beloved action-adventure game developed by Nintendo for the Super Nintendo Entertainment System. Released in 1991, it follows protagonist Link on a quest to save Hyrule, battling enemies and solving puzzles along the way. Praised for its innovative gameplay and captivating storytelling, it's considered one of the greatest video games of all time. With re-releases on modern platforms, its legacy continues to captivate new generations of gamers.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Street Fighter II Turbo",
    "Category": "Fighting",
    "ReleaseYear": 1992,
    "Publisher": "Capcom",
    "ConsoleType": "Arcade",
    "CoverImage": "https://upload.wikimedia.org/wikipedia/en/8/81/Street_Fighter_II_Hyper_Fighting_cover.jpg",
    "Description": "Street Fighter II Turbo: Hyper Fighting is a competitive fighting game released by Capcom for arcades in 1992. As the third arcade version of Street Fighter II, it brought faster gameplay and new special moves for certain characters. This installment marked the end of the original CP System hardware for the series, paving the way for its successor, the CP System II. With its enhanced speed and refined character balance, Turbo remains a standout title in the Street Fighter franchise.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Outrun",
    "Category": "Racing",
    "ReleaseYear": 1986,
    "Publisher": "Sega",
    "ConsoleType": "Arcade",
    "CoverImage": "https://www.retroplace.com/pics/smd/packshots/39696--turbo-outrun.png",
    "Description": "Turbo Outrun is an exhilarating racing arcade game developed by Tiertex Design Studios and published by Sega. Set in Japan, this fast-paced automobile game offers an immersive experience with its arcade-style gameplay. Released on March 27, 1992, it combines elements of racing and arcade genres, delivering thrilling action for players. With its captivating gameplay and engaging mechanics, Turbo Outrun offers an exciting journey for racing enthusiasts.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Pole Position",
    "Category": "Racing",
    "ReleaseYear": 1982,
    "Publisher": "Namco",
    "ConsoleType": "Arcade",
    "CoverImage": "https://pixelatedarcade.objects-us-east-1.dream.io/coverart/472/1954/cover_0a8-pole-position-front-cover-artwork.jpg",
    "Description": "Pole Position is an action racing game originally released in arcades by Namco in 1982 and later ported to numerous home computers and game consoles. In the game the player controls a Formula One race car with the goal of racing against other cars in a grand prix to earn the highest score possible.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Galaxian",
    "Category": "Apple II",
    "ReleaseYear": 1979,
    "Publisher": "Namco",
    "ConsoleType": "Arcade",
    "CoverImage": "https://pixelatedarcade.objects-us-east-1.dream.io/coverart/85/1945/cover_7c8-galaxian-front-cover-artwork.jpg",
    "Description": "Galaxian is a Space Invaders style shooter developed by Namco Limited and originally released in arcades in 1979 and later ported to many popular home computers and game consoles. In the game players control a spaceship which can move along the bottom of the screen and need to earn as many points as possible by shooting the numerous Galaxian invaders.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Hacker",
    "Category": "Adventure/Strategy",
    "ReleaseYear": 1985,
    "Publisher": "Activision",
    "ConsoleType": "Atari ST",
    "CoverImage": "https://pixelatedarcade.objects-us-east-1.dream.io/coverart/397/1172/cover_ba1-hacker-front-cover-artwork.jpg",
    "Description": "Hacker is an adventure/strategy game based around the theme of hacking into an unknown computer. In keeping with this theme the game included no instructions (other than loading instructions), no clues, and indicated no rules so the player needed to figure out how to get in to the computer and what was going on. It begins with a mostly blank screen with the text Logon please... and it's up to the player to solve the puzzles from there.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "POKÉMON XD: GALE OF DARKNESS",
    "Category": "RPG",
    "ReleaseYear": 2005,
    "Publisher": "Nintendo",
    "ConsoleType": "Nintendo Gamecube",
    "CoverImage": "https://cdn.mobygames.com/covers/6556263-pokemon-xd-gale-of-darkness-gamecube-front-cover.jpg",
    "Description": "Pokémon XD: Gale of Darkness is an adventure-packed role-playing game developed by Genius Sonority and published by Nintendo. Released as a sequel to Pokémon Colosseum, this game offers an immersive journey set in the Orre region. Players embark on a quest to thwart the evil plans of Cipher, an organization seeking to control Pokémon for nefarious purposes. With its captivating storyline, strategic battles, and a wide variety of Pokémon to capture and train, Pokémon XD: Gale of Darkness provides an engaging experience for fans of the Pokémon series.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Caverns of Mars",
    "Category": "Action",
    "ReleaseYear": 1982,
    "Publisher": "Atari",
    "ConsoleType": "Atari 8-bit",
    "CoverImage": "https://pixelatedarcade.objects-us-east-1.dream.io/coverart/2501/1925/cover_f02-caverns-of-mars-front-cover-artwork.jpg",
    "Description": "Caverns of Mars is an Atari classic, a vertically scrolling shooter where players navigate treacherous Martian caverns, activate a hidden bomb, and escape before it detonates. Inspired by Scramble, it challenges pilots to avoid obstacles like rockets and laser gates while managing fuel levels for survival. With its addictive gameplay and strategic depth, it remains a beloved title among retro gaming enthusiasts.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "The Secret of Monkey Island",
    "Category": "Adventure",
    "ReleaseYear": 1991,
    "Publisher": "Lucasfilm Games LLC",
    "ConsoleType": "Atari ST",
    "CoverImage": "https://pixelatedarcade.objects-us-east-1.dream.io/coverart/1232/398/cover_0a2-the-secret-of-monkey-island-front-cover-artwork.jpg",
    "Description": "The Secret of Monkey Island, a classic point-and-click adventure game, invites players into a whimsical world filled with pirates, puzzles, and witty humor. Originally released for multiple platforms including Amiga, Atari ST, and IBM PC, it follows the journey of wannabe pirate Guybrush Threepwood as he explores the Caribbean, battles ghost pirates, and seeks the legendary treasure of Monkey Island. With its charming characters, clever dialogue, and engaging storyline, it remains a timeless favorite among adventure game enthusiasts.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Grand Theft Auto: Vice City",
    "Category": "Action",
    "ReleaseYear": 2002,
    "Publisher": "Rockstar Games",
    "ConsoleType": "PlayStation 2",
    "CoverImage": "https://cdn.mobygames.com/covers/256908-grand-theft-auto-vice-city-windows-other.png",
    "Description": "Grand Theft Auto: Vice City takes players on a nostalgic trip to the neon-soaked streets of 1980s Miami. As Tommy Vercetti, a criminal seeking to take control of the city's underworld, players engage in a thrilling open-world experience filled with car chases, shootouts, and criminal activities. With its iconic soundtrack, vivid visuals, and compelling narrative, Vice City captures the essence of the era while delivering an unforgettable gaming experience.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Street Fighter II",
    "Category": "Action",
    "ReleaseYear": 1991,
    "Publisher": "Capcom",
    "ConsoleType": "Arcade",
    "CoverImage": "https://cdn.mobygames.com/covers/4313963-street-fighter-ii-amiga-front-cover.jpg",
    "Description": "Street Fighter II revolutionized the arcade fighting genre upon its release in 1991. With its diverse roster of characters, intuitive controls, and intense one-on-one battles, it quickly became a phenomenon in the gaming world. Players around the globe engaged in fierce competitions, mastering special moves and combos to emerge victorious. Its impact on gaming culture is undeniable, cementing its status as a timeless classic.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Super Mario Bros. 2",
    "Category": "Action",
    "ReleaseYear": 1988,
    "Publisher": "Nintendo",
    "ConsoleType": "NES",
    "CoverImage": "https://pixelatedarcade.objects-us-east-1.dream.io/coverart/2996/2176/cover_75e-super-mario-bros-2-front-cover-artwork.jpg",
    "Description": "Super Mario Bros. 2 takes players on a whimsical journey through the Mushroom Kingdom in 1988. With its innovative gameplay mechanics and vibrant graphics, it offered a refreshing twist on the classic Mario formula. Players could choose between Mario, Luigi, Toad, and Princess Peach, each with their unique abilities, adding depth to the gameplay experience. From tossing enemies to uncovering hidden secrets, every moment was filled with excitement and adventure. Its legacy continues to endure, earning its place as a beloved entry in the iconic Mario series.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Super Mario Bros. 3",
    "Category": "Action",
    "ReleaseYear": 1988,
    "Publisher": "Nintendo",
    "ConsoleType": "NES",
    "CoverImage": "https://pixelatedarcade.objects-us-east-1.dream.io/coverart/2997/2177/cover_b8f-super-mario-bros-3-front-cover-artwork.jpg",
    "Description": "Super Mario Bros. 3 revolutionized the gaming landscape when it launched in 1988. This iconic platformer introduced a wealth of new features, including diverse power-ups like the Super Leaf and Tanooki Suit, which granted Mario new abilities like flight and statue transformation. With its expansive world map, inventive level design, and memorable enemies, the game offered players a rich and immersive experience. Its influence can still be felt today, as it remains one of the best-selling video games of all time and a cherished classic among gamers worldwide.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Super Mario 64",
    "Category": "Action",
    "ReleaseYear": 1996,
    "Publisher": "Nintendo",
    "ConsoleType": "Nintendo 64",
    "CoverImage": "https://cdn.mobygames.com/covers/10905486-super-mario-64-nintendo-64-front-cover.jpg",
    "Description": "Super Mario 64, released in 1996, is a groundbreaking 3D platformer that redefined the gaming industry. As Mario, players explore Princess Peach's castle and its surrounding worlds to collect Power Stars and rescue Princess Peach from the clutches of Bowser. With its innovative free-roaming 3D environment, fluid movement mechanics, and imaginative level design, Super Mario 64 set a new standard for 3D gaming. Its influence can be seen in countless subsequent titles, and it remains beloved by gamers for its timeless gameplay and charm.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Super Mario World",
    "Category": "Action",
    "ReleaseYear": 1990,
    "Publisher": "Nintendo",
    "ConsoleType": "SNES",
    "CoverImage": "https://cdn.mobygames.com/covers/4237596-super-mario-world-snes-front-cover.jpg",
    "Description": "Super Mario World, released in 1990 for the Super Nintendo Entertainment System (SNES), is a classic 2D platformer that follows Mario and Luigi on their quest to save Princess Toadstool and the Mushroom Kingdom from the villainous Bowser. Set across various colorful worlds, players traverse levels filled with enemies, obstacles, and secrets, utilizing power-ups like the Super Mushroom and Cape Feather to aid their journey. With its tight controls, inventive level design, and charming visuals, Super Mario World is widely regarded as one of the greatest video games of all time, captivating players with its sense of adventure and exploration.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "The Legend of Zelda: Ocarina of Time",
    "Category": "Action",
    "ReleaseYear": 1998,
    "Publisher": "Nintendo",
    "ConsoleType": "Nintendo 64",
    "CoverImage": "https://cdn.mobygames.com/covers/4352943-the-legend-of-zelda-ocarina-of-time-nintendo-64-front-cover.jpg",
    "Description": "The Legend of Zelda: Ocarina of Time, released in 1998 for the Nintendo 64, is an iconic action-adventure game that follows Link on his quest to stop the evil sorcerer Ganondorf and rescue Princess Zelda. Set in the land of Hyrule, players explore vast dungeons, solve puzzles, and battle enemies using a variety of weapons and magical abilities. The game introduced groundbreaking 3D graphics, immersive gameplay mechanics, and a memorable soundtrack, earning critical acclaim and numerous awards. Ocarina of Time is often considered one of the greatest video games of all time for its innovation, storytelling, and lasting impact on the gaming industry.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Doom",
    "Category": "Shooter",
    "ReleaseYear": 1993,
    "Publisher": "Atari",
    "ConsoleType": "DOS",
    "CoverImage": "https://cdn.mobygames.com/covers/3947919-doom-dos-front-cover.jpg",
    "Description": "Doom, released in 1993, is a seminal first-person shooter developed by id Software. Set on Mars, players assume the role of an unnamed space marine as they battle demonic forces unleashed by experiments conducted by the Union Aerospace Corporation. Renowned for its fast-paced gameplay, atmospheric level design, and groundbreaking graphics, Doom revolutionized the gaming industry and popularized the first-person shooter genre. With its iconic weapons, intense action, and multiplayer mode, Doom remains a classic title that has inspired countless games and has left a lasting legacy in video game history.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  },
  {
    "Name": "Tomb Raider",
    "Category": "Platformer",
    "ReleaseYear": 1996,
    "Publisher": "Eidos Interactive Limited",
    "ConsoleType": "DOS",
    "CoverImage": "https://cdn.mobygames.com/covers/5024581-tomb-raider-dos-front-cover.jpg",
    "Description": "Tomb Raider, released for DOS in 1996, is an iconic action-adventure game developed by Core Design. Players assume the role of the adventurous archaeologist Lara Croft as she navigates treacherous environments, solves puzzles, and battles enemies in search of ancient artifacts. Set in exotic locations around the world, Tomb Raider combines exploration, platforming, and combat elements to deliver an immersive gaming experience. With its groundbreaking 3D graphics, challenging gameplay, and memorable protagonist, Tomb Raider became a landmark title in the gaming industry, spawning a successful franchise that continues to thrive to this day.",
    "RentalPricePerWeek": 5.0,
    "IsAvailable": true,
    "IsDeleted": false
  }
]